; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 8886)
	(= (fuel plane1) 2854)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city6)
	(= (capacity plane2) 2127)
	(= (fuel plane2) 931)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at person1 city1)
	(at person2 city2)
	(at person3 city2)
	(at person4 city3)
	(at person5 city5)
	(at person6 city2)
	(at person7 city0)
	(at person8 city1)
	(at person9 city1)
	(at person10 city6)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 562)
	(= (distance city0 city2) 566)
	(= (distance city0 city3) 744)
	(= (distance city0 city4) 532)
	(= (distance city0 city5) 560)
	(= (distance city0 city6) 873)
	(= (distance city1 city0) 562)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 964)
	(= (distance city1 city3) 537)
	(= (distance city1 city4) 908)
	(= (distance city1 city5) 768)
	(= (distance city1 city6) 543)
	(= (distance city2 city0) 566)
	(= (distance city2 city1) 964)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 861)
	(= (distance city2 city4) 854)
	(= (distance city2 city5) 557)
	(= (distance city2 city6) 725)
	(= (distance city3 city0) 744)
	(= (distance city3 city1) 537)
	(= (distance city3 city2) 861)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 571)
	(= (distance city3 city5) 528)
	(= (distance city3 city6) 693)
	(= (distance city4 city0) 532)
	(= (distance city4 city1) 908)
	(= (distance city4 city2) 854)
	(= (distance city4 city3) 571)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 966)
	(= (distance city4 city6) 847)
	(= (distance city5 city0) 560)
	(= (distance city5 city1) 768)
	(= (distance city5 city2) 557)
	(= (distance city5 city3) 528)
	(= (distance city5 city4) 966)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 520)
	(= (distance city6 city0) 873)
	(= (distance city6 city1) 543)
	(= (distance city6 city2) 725)
	(= (distance city6 city3) 693)
	(= (distance city6 city4) 847)
	(= (distance city6 city5) 520)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city1)
	(at person2 city2)
	(at person3 city0)
	(at person4 city3)
	(at person5 city3)
	(at person6 city3)
	(at person7 city3)
	(at person8 city3)
	(at person9 city4)
	(at person10 city1)
	))

(:metric minimize (+ (* 3 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person7 plane1 city0)
   deleted: (at person7 city0)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 10
2. (board person10 plane2 city6)
   deleted: (at person10 city6)
   added: (in person10 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 10
3. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 2232, (fuel plane1) from 2854 to 622
   goals met: 3 of 10
4. (debark person7 plane1 city3)
   deleted: (in person7 plane1)
   added: (at person7 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 10
5. (fly plane2 city6 city5)
   deleted: (at plane2 city6)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 2232 to 2752, (fuel plane2) from 931 to 411
   goals met: 4 of 10
6. (board person5 plane2 city5)
   deleted: (at person5 city5)
   added: (in person5 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 4 of 10
7. (refuel plane2 city5)
   changed: (fuel plane2) from 411 to 2127
   goals met: 4 of 10
8. (fly plane2 city5 city3)
   deleted: (at plane2 city5)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 2752 to 3280, (fuel plane2) from 2127 to 1599
   goals met: 4 of 10
9. (debark person5 plane2 city3)
   deleted: (in person5 plane2)
   added: (at person5 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 5 of 10
10. (fly plane2 city3 city1)
   deleted: (at plane2 city3)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 3280 to 3817, (fuel plane2) from 1599 to 1062
   goals met: 5 of 10
11. (debark person10 plane2 city1)
   deleted: (in person10 plane2)
   added: (at person10 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 6 of 10
12. (board person8 plane2 city1)
   deleted: (at person8 city1)
   added: (in person8 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 6 of 10
13. (board person9 plane2 city1)
   deleted: (at person9 city1)
   added: (in person9 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 6 of 10
14. (fly plane2 city1 city3)
   deleted: (at plane2 city1)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 3817 to 4354, (fuel plane2) from 1062 to 525
   goals met: 6 of 10
15. (refuel plane2 city3)
   changed: (fuel plane2) from 525 to 2127
   goals met: 6 of 10
16. (debark person8 plane2 city3)
   deleted: (in person8 plane2)
   added: (at person8 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 7 of 10
17. (fly plane2 city3 city4)
   deleted: (at plane2 city3)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 4354 to 4925, (fuel plane2) from 2127 to 1556
   goals met: 7 of 10
18. (debark person9 plane2 city4)
   deleted: (in person9 plane2)
   added: (at person9 city4)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 10
19. (fly plane2 city4 city2)
   deleted: (at plane2 city4)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 4925 to 5779, (fuel plane2) from 1556 to 702
   goals met: 8 of 10
20. (board person6 plane2 city2)
   deleted: (at person6 city2)
   added: (in person6 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 8 of 10
21. (board person3 plane2 city2)
   deleted: (at person3 city2)
   added: (in person3 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 8 of 10
22. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 5779 to 6345, (fuel plane2) from 702 to 136
   goals met: 8 of 10
23. (debark person3 plane2 city0)
   deleted: (in person3 plane2)
   added: (at person3 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 9 of 10
24. (refuel plane2 city0)
   changed: (fuel plane2) from 136 to 2127
   goals met: 9 of 10
25. (fly plane2 city0 city3)
   deleted: (at plane2 city0)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 6345 to 7089, (fuel plane2) from 2127 to 1383
   goals met: 9 of 10
26. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 10 of 10
